patchew-project/qemu/hw/ssi/rp2040_xip.c
/*
 * RP2040 XIP/SSI flash controller emulation
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qemu/units.h"
#include "qapi/error.h"
#include "elf.h"
#include "exec/memattrs.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/loader.h"
#include "hw/misc/rp2040_nyi.h"
#include "hw/ssi/rp2040_xip.h"
#include "qemu/log.h"
#include "system/address-spaces.h"
#include "trace.h"

#define RP2040_XIP_CTRL_EN           0x1
#define RP2040_XIP_CTRL_ERR_BADWRITE 0x2
#define RP2040_XIP_STAT_FLUSH_READY  0x1
#define RP2040_XIP_STAT_FIFO_EMPTY   0x2
#define RP2040_XIP_STAT_FIFO_FULL    0x4
#define RP2040_XIP_FLASH_BASE        0x10000000
#define RP2040_XIP_CTRL              0x00
#define RP2040_XIP_FLUSH             0x04
#define RP2040_XIP_STAT              0x08
#define RP2040_XIP_CTR_HIT           0x0c
#define RP2040_XIP_CTR_ACC           0x10
#define RP2040_XIP_STREAM_ADDR       0x14
#define RP2040_XIP_STREAM_CTR        0x18
#define RP2040_XIP_STREAM_FIFO       0x1c
#define RP2040_XIP_STREAM_CTR_MASK   0x003fffff

#define RP2040_SSI_CTRLR0     0x00
#define RP2040_SSI_CTRLR1     0x04
#define RP2040_SSI_SSIENR     0x08
#define RP2040_SSI_SER        0x10
#define RP2040_SSI_BAUDR      0x14
#define RP2040_SSI_TXFTLR     0x18
#define RP2040_SSI_RXFTLR     0x1c
#define RP2040_SSI_TXFLR      0x20
#define RP2040_SSI_RXFLR      0x24
#define RP2040_SSI_SR         0x28
#define RP2040_SSI_IMR        0x2c
#define RP2040_SSI_ISR        0x30
#define RP2040_SSI_RISR       0x34
#define RP2040_SSI_TXOICR     0x38
#define RP2040_SSI_RXOICR     0x3c
#define RP2040_SSI_RXUICR     0x40
#define RP2040_SSI_MSTICR     0x44
#define RP2040_SSI_ICR        0x48
#define RP2040_SSI_DMACR      0x4c
#define RP2040_SSI_DMATDLR    0x50
#define RP2040_SSI_DMARDLR    0x54
#define RP2040_SSI_IDR        0x58
#define RP2040_SSI_VERSION_ID 0x5c
#define RP2040_SSI_DR0        0x60
#define RP2040_SSI_DR_END     0xec
#define RP2040_SSI_RX_SAMPLE_DLY 0xf0
#define RP2040_SSI_SPI_CTRLR0 0xf4

#define RP2040_SSI_SR_BUSY 0x01
#define RP2040_SSI_SR_TFNF 0x02
#define RP2040_SSI_SR_TFE  0x04
#define RP2040_SSI_SR_RFNE 0x08
#define RP2040_SSI_SR_RFF  0x10

#define FLASH_CMD_READ         0x03
#define FLASH_CMD_WRITE_STATUS 0x01
#define FLASH_CMD_PAGE_PROGRAM 0x02
#define FLASH_CMD_READ_STATUS  0x05
#define FLASH_CMD_READ_STATUS2 0x35
#define FLASH_CMD_WRITE_ENABLE 0x06
#define FLASH_CMD_READ_UNIQUE_ID 0x4b
#define FLASH_CMD_SECTOR_ERASE 0x20
#define FLASH_CMD_QUAD_IO_READ 0xeb
#define FLASH_CMD_CONTINUATION_READ 0xa0

#define RP2040_SSI_DMACR_TDMAE BIT(1)
#define RP2040_SSI_DMACR_RDMAE BIT(0)

#define FLASH_UNIQUE_ID_SIZE 8
#define FLASH_UNIQUE_ID_DUMMY_BYTES 4
#define FLASH_UID_DEFAULT 0x3eb8a7493fcc0608ull

#define FLASH_STATUS_WIP 0x01
#define FLASH_STATUS_WEL 0x02
#define FLASH_PAGE_SIZE  256
#define FLASH_SECTOR_SIZE 4096

#define UF2_MAGIC_START0 0x0a324655
#define UF2_MAGIC_START1 0x9e5d5157
#define UF2_MAGIC_END    0x0ab16f30
#define UF2_BLOCK_SIZE   512
#define UF2_HEADER_SIZE  32
#define UF2_MAX_PAYLOAD  476

#define UF2_FLAG_NOT_MAIN_FLASH       BIT(0)
#define UF2_FLAG_FAMILY_ID_PRESENT    BIT(13)
#define UF2_RP2040_FAMILY_ID          0xe48bff56

#define ATOMIC_ALIAS_MASK 0x3000
#define ATOMIC_XOR        0x1000
#define ATOMIC_SET        0x2000
#define ATOMIC_CLR        0x3000

#define RP2040_BOOT2_SIZE 256
#define RP2040_BOOT2_CRC_SIZE 252
#define RP2040_BOOT2_CRC_INIT 0xffffffff
#define RP2040_BOOT2_CRC_POLY 0x04c11db7
#define RP2040_SRAM_BASE 0x20000000
#define RP2040_SRAM_END  0x20042000

static uint32_t rp2040_xip_apply_alias(uint32_t old, uint32_t value,
                                       hwaddr alias)
{
    switch (alias) {
    case ATOMIC_XOR:
        return old ^ value;
    case ATOMIC_SET:
        return old | value;
    case ATOMIC_CLR:
        return old & ~value;
    default:
        return value;
    }
}

static void rp2040_xip_rx_clear(RP2040XipState *s)
{
    s->rx_len = 0;
    s->rx_pos = 0;
}

static void rp2040_xip_rx_push(RP2040XipState *s, uint8_t value)
{
    if (s->rx_len == ARRAY_SIZE(s->rx) && s->rx_pos > 0) {
        memmove(s->rx, s->rx + s->rx_pos, s->rx_len - s->rx_pos);
        s->rx_len -= s->rx_pos;
        s->rx_pos = 0;
    }

    if (s->rx_len < ARRAY_SIZE(s->rx)) {
        s->rx[s->rx_len++] = value;
        qemu_irq_pulse(s->dreq_rx);
    }
}

static bool rp2040_xip_rx_compact(RP2040XipState *s)
{
    if (s->rx_len == s->rx_pos) {
        rp2040_xip_rx_clear(s);
        return true;
    }
    if (s->rx_pos > 0) {
        memmove(s->rx, s->rx + s->rx_pos, s->rx_len - s->rx_pos);
        s->rx_len -= s->rx_pos;
        s->rx_pos = 0;
        return true;
    }
    return false;
}

static bool rp2040_xip_flash_word(RP2040XipState *s, uint32_t addr,
                                  uint32_t *value)
{
    if (s->flash_size < sizeof(uint32_t) ||
        addr > s->flash_size - sizeof(uint32_t)) {
        *value = 0xffffffff;
        return false;
    }

    *value = ldl_le_p(s->storage + addr);
    return true;
}

static void rp2040_xip_rx_push_ssi_word(RP2040XipState *s, uint32_t value)
{
    if (ARRAY_SIZE(s->rx) - (s->rx_len - s->rx_pos) < sizeof(uint32_t)) {
        rp2040_xip_rx_compact(s);
    }
    if (ARRAY_SIZE(s->rx) - s->rx_len < sizeof(uint32_t)) {
        return;
    }

    /*
     * Non-XIP 32-bit SSI reads deliver the serial flash byte stream in the
     * opposite byte order expected by the RP2040 system bus; SDK users enable
     * DMA BSWAP when copying words from SSI_DR0.
     */
    s->rx[s->rx_len++] = extract32(value, 24, 8);
    s->rx[s->rx_len++] = extract32(value, 16, 8);
    s->rx[s->rx_len++] = extract32(value, 8, 8);
    s->rx[s->rx_len++] = extract32(value, 0, 8);
    qemu_irq_pulse(s->dreq_rx);
}

static void rp2040_xip_ssi_bulk_fill(RP2040XipState *s)
{
    while (s->ssi_bulk_remaining > 0 &&
           ARRAY_SIZE(s->rx) - (s->rx_len - s->rx_pos) >=
           sizeof(uint32_t)) {
        uint32_t value;

        rp2040_xip_rx_compact(s);
        rp2040_xip_flash_word(s, s->ssi_bulk_addr, &value);
        rp2040_xip_rx_push_ssi_word(s, value);
        s->ssi_bulk_addr += sizeof(uint32_t);
        s->ssi_bulk_remaining--;
    }
}

static void rp2040_xip_ssi_bulk_start(RP2040XipState *s, uint32_t addr,
                                      uint32_t words)
{
    rp2040_xip_rx_clear(s);
    s->ssi_bulk_addr = addr;
    s->ssi_bulk_remaining = words;
    rp2040_xip_ssi_bulk_fill(s);
}

static void rp2040_xip_update_stream_dreq(RP2040XipState *s)
{
    qemu_set_irq(s->dreq_stream, s->stream_fifo_len > s->stream_fifo_pos);
}

static void rp2040_xip_stream_clear(RP2040XipState *s)
{
    s->stream_fifo_len = 0;
    s->stream_fifo_pos = 0;
    rp2040_xip_update_stream_dreq(s);
}

