patchew-project/qemu/hw/ssi/rp2040_xip.c
static uint32_t rp2040_xip_stream_word(RP2040XipState *s)
{
    uint32_t off;

    if (s->flash_size < sizeof(uint32_t)) {
        return 0xffffffff;
    }
    if (s->stream_addr < RP2040_XIP_FLASH_BASE ||
        s->stream_addr - RP2040_XIP_FLASH_BASE >
        s->flash_size - sizeof(uint32_t)) {
        return 0xffffffff;
    }

    off = s->stream_addr - RP2040_XIP_FLASH_BASE;
    return ldl_le_p(s->storage + off);
}

static void rp2040_xip_stream_fill(RP2040XipState *s)
{
    if (s->stream_fifo_pos == s->stream_fifo_len) {
        s->stream_fifo_pos = 0;
        s->stream_fifo_len = 0;
    }

    while (s->stream_ctr > 0 &&
           s->stream_fifo_len < ARRAY_SIZE(s->stream_fifo)) {
        s->stream_fifo[s->stream_fifo_len++] = rp2040_xip_stream_word(s);
        s->stream_addr += 4;
        s->stream_ctr--;
    }

    rp2040_xip_update_stream_dreq(s);
}

static uint32_t rp2040_xip_stream_pop(RP2040XipState *s)
{
    uint32_t value = 0;

    rp2040_xip_stream_fill(s);
    if (s->stream_fifo_pos < s->stream_fifo_len) {
        value = s->stream_fifo[s->stream_fifo_pos++];
    }
    rp2040_xip_stream_fill(s);
    return value;
}

static uint32_t rp2040_xip_stat(RP2040XipState *s)
{
    uint32_t stat = RP2040_XIP_STAT_FLUSH_READY;

    rp2040_xip_stream_fill(s);
    if (s->stream_fifo_pos == s->stream_fifo_len) {
        stat |= RP2040_XIP_STAT_FIFO_EMPTY;
    }
    if (s->stream_fifo_len - s->stream_fifo_pos ==
        ARRAY_SIZE(s->stream_fifo)) {
        stat |= RP2040_XIP_STAT_FIFO_FULL;
    }

    return stat;
}

static uint8_t rp2040_xip_status(RP2040XipState *s)
{
    uint8_t status = 0;

    if (s->busy) {
        status |= FLASH_STATUS_WIP;
    }
    if (s->write_enable) {
        status |= FLASH_STATUS_WEL;
    }

    return status;
}

static uint32_t rp2040_xip_tx_addr(RP2040XipState *s)
{
    return (uint32_t)s->tx[1] << 16 | s->tx[2] << 8 | s->tx[3];
}

static uint32_t rp2040_xip_quad_io_addr(RP2040XipState *s)
{
    return (uint32_t)s->tx[1] << 16 | s->tx[2] << 8 | s->tx[3];
}

static uint8_t rp2040_xip_flash_uid_byte(RP2040XipState *s, unsigned index)
{
    return extract64(s->flash_uid, (FLASH_UNIQUE_ID_SIZE - 1 - index) * 8, 8);
}

static void rp2040_xip_finish_busy(RP2040XipState *s)
{
    s->busy = false;
}

static void rp2040_xip_reset_tx(RP2040XipState *s)
{
    s->tx_len = 0;
    s->tx_unsupported_logged = false;
    s->ssi_bulk_remaining = 0;
}

static bool rp2040_xip_writeback(RP2040XipState *s, Error **errp)
{
    g_autoptr(GError) gerr = NULL;

    if (!s->flash_file || !*s->flash_file) {
        return true;
    }

    if (!g_file_set_contents(s->flash_file, (const char *)s->storage,
                             s->flash_size, &gerr)) {
        error_setg(errp, "could not write flash file '%s': %s",
                   s->flash_file, gerr->message);
        return false;
    }

    return true;
}

static void rp2040_xip_writeback_or_warn(RP2040XipState *s)
{
    Error *local_err = NULL;

    if (!rp2040_xip_writeback(s, &local_err)) {
        warn_report_err(local_err);
    }
}

static uint32_t rp2040_xip_boot2_crc(const uint8_t *data)
{
    uint32_t crc = RP2040_BOOT2_CRC_INIT;
    int i;
    int bit;

    for (i = 0; i < RP2040_BOOT2_CRC_SIZE; i++) {
        crc ^= (uint32_t)data[i] << 24;
        for (bit = 0; bit < 8; bit++) {
            if (crc & BIT(31)) {
                crc = (crc << 1) ^ RP2040_BOOT2_CRC_POLY;
            } else {
                crc <<= 1;
            }
        }
    }

    return crc;
}

static bool rp2040_xip_boot2_empty(const uint8_t *data)
{
    int i;

    for (i = 0; i < RP2040_BOOT2_SIZE; i++) {
        if (data[i] != 0xff) {
            return false;
        }
    }

    return true;
}

static bool rp2040_xip_boot2_looks_like_vector_table(const uint8_t *data)
{
    uint32_t initial_sp = ldl_le_p(data);
    uint32_t reset = ldl_le_p(data + 4);

    return initial_sp >= RP2040_SRAM_BASE &&
           initial_sp <= RP2040_SRAM_END &&
           reset >= RP2040_XIP_FLASH_BASE &&
           reset < RP2040_XIP_FLASH_BASE + MiB &&
           (reset & 1);
}

static bool rp2040_xip_fixup_boot2(RP2040XipState *s, const char *filename,
                                   Error **errp)
{
    uint32_t crc;

    if (s->flash_size < RP2040_BOOT2_SIZE) {
        error_setg(errp, "flash is too small for an RP2040 boot2 block");
        return false;
    }

    if (rp2040_xip_boot2_empty(s->storage)) {
        error_setg(errp, "image '%s' does not contain RP2040 boot2 at "
                   "0x%08x", filename, RP2040_XIP_FLASH_BASE);
        return false;
    }

    if (rp2040_xip_boot2_looks_like_vector_table(s->storage)) {
        error_setg(errp, "image '%s' starts with an application vector table, "
                   "not RP2040 boot2; use a Pico SDK UF2 or an ELF with "
                   "boot2 linked at 0x%08x", filename, RP2040_XIP_FLASH_BASE);
        return false;
    }

    crc = rp2040_xip_boot2_crc(s->storage);
    stl_le_p(s->storage + RP2040_BOOT2_CRC_SIZE, crc);

    return true;
}

static void rp2040_xip_program(RP2040XipState *s)
{
    uint32_t addr;
    uint32_t page_end;
    unsigned data_len;
    unsigned i;

    trace_rp2040_xip_program(s->tx_len >= 4 ? rp2040_xip_tx_addr(s) : 0,
                             s->tx_len > 4 ? s->tx_len - 4 : 0,
                             s->write_enable);

    if (!s->write_enable) {
        return;
    }

    s->write_enable = false;

    if (s->tx_len <= 4) {
        return;
    }

    addr = rp2040_xip_tx_addr(s);
    if (addr >= s->flash_size) {
        return;
    }

    page_end = ROUND_UP(addr + 1, FLASH_PAGE_SIZE);
    data_len = MIN(s->tx_len - 4, page_end - addr);
    data_len = MIN(data_len, s->flash_size - addr);

    for (i = 0; i < data_len; i++) {
        s->storage[addr + i] &= s->tx[4 + i];
    }

    rp2040_xip_writeback_or_warn(s);
    s->busy = true;
}

static void rp2040_xip_erase(RP2040XipState *s)
{
    uint32_t addr;
    uint32_t base;

    trace_rp2040_xip_erase(s->tx_len >= 4 ? rp2040_xip_tx_addr(s) : 0,
                           s->write_enable);

    if (!s->write_enable) {
        return;
    }

