patchew-project/qemu/hw/ssi/rp2040_xip.c
    s->write_enable = false;

    if (s->tx_len < 4) {
        return;
    }

    addr = rp2040_xip_tx_addr(s);
    base = QEMU_ALIGN_DOWN(addr, FLASH_SECTOR_SIZE);
    if (base >= s->flash_size) {
        return;
    }

    memset(&s->storage[base], 0xff, MIN(FLASH_SECTOR_SIZE,
                                       s->flash_size - base));
    rp2040_xip_writeback_or_warn(s);
    s->busy = true;
}

static void rp2040_xip_finish_command(RP2040XipState *s)
{
    if (s->tx_len == 0) {
        return;
    }

    trace_rp2040_xip_finish_command(s->tx[0], s->tx_len);

    switch (s->tx[0]) {
    case FLASH_CMD_WRITE_STATUS:
        s->write_enable = false;
        break;
    case FLASH_CMD_PAGE_PROGRAM:
        rp2040_xip_program(s);
        break;
    case FLASH_CMD_SECTOR_ERASE:
        rp2040_xip_erase(s);
        break;
    default:
        break;
    }

    rp2040_xip_reset_tx(s);
}

static void rp2040_xip_dr_write(RP2040XipState *s, uint8_t value)
{
    uint32_t addr;

    if (s->tx_len < ARRAY_SIZE(s->tx)) {
        s->tx[s->tx_len++] = value;
    }

    switch (s->tx[0]) {
    case FLASH_CMD_WRITE_STATUS:
        s->write_enable = false;
        rp2040_xip_rx_push(s, 0);
        break;
    case FLASH_CMD_PAGE_PROGRAM:
    case FLASH_CMD_SECTOR_ERASE:
        rp2040_xip_rx_push(s, 0);
        break;
    case FLASH_CMD_WRITE_ENABLE:
        s->write_enable = true;
        rp2040_xip_rx_push(s, 0);
        rp2040_xip_reset_tx(s);
        break;
    case FLASH_CMD_READ_STATUS:
        rp2040_xip_rx_push(s, rp2040_xip_status(s));
        rp2040_xip_finish_busy(s);
        rp2040_xip_reset_tx(s);
        break;
    case FLASH_CMD_READ_STATUS2:
        rp2040_xip_rx_push(s, 0);
        rp2040_xip_finish_busy(s);
        rp2040_xip_reset_tx(s);
        break;
    case FLASH_CMD_READ_UNIQUE_ID:
        if (s->tx_len <= 1 + FLASH_UNIQUE_ID_DUMMY_BYTES) {
            rp2040_xip_rx_push(s, 0);
        } else {
            unsigned index = s->tx_len - 2 - FLASH_UNIQUE_ID_DUMMY_BYTES;

            rp2040_xip_rx_push(s, index < FLASH_UNIQUE_ID_SIZE ?
                               rp2040_xip_flash_uid_byte(s, index) : 0);
        }
        break;
    case FLASH_CMD_READ:
        if (s->tx_len <= 4) {
            rp2040_xip_rx_push(s, 0);
        } else {
            addr = rp2040_xip_tx_addr(s) + s->tx_len - 5;
            rp2040_xip_rx_push(s, addr < s->flash_size ?
                               s->storage[addr] : 0xff);
        }
        break;
    case FLASH_CMD_QUAD_IO_READ:
        /*
         * Minimal 0xeb fast-read support for the RP2040 mask ROM path.
         * The ROM clocks opcode, 24-bit address and mode/dummy bytes before
         * consuming data. We do not model bus width or wait-cycle timing here.
         */
        if (s->tx_len <= 5) {
            rp2040_xip_rx_push(s, 0);
        } else {
            addr = rp2040_xip_quad_io_addr(s) + s->tx_len - 6;
            rp2040_xip_rx_push(s, addr < s->flash_size ?
                               s->storage[addr] : 0xff);
        }
        break;
    case 0x00:
        rp2040_xip_rx_push(s, 0);
        break;
    default:
        /*
         * The RP2040 boot ROM performs small full-duplex SSI transactions
         * while probing the flash path. Even for commands we do not model yet,
         * a transmitted byte clocks one receive byte back from the bus.
         */
        if (!s->tx_unsupported_logged) {
            g_autofree char *detail = g_strdup_printf("opcode 0x%02x",
                                                      s->tx[0]);

            rp2040_log_nyi("xip.ssi", "flash command", detail);
            s->tx_unsupported_logged = true;
        }
        rp2040_xip_rx_push(s, 0);
        break;
    }
}

MemTxResult rp2040_xip_read_data(RP2040XipState *s, hwaddr addr,
                                 uint64_t *data, unsigned size)
{
    uint64_t value = 0;
    unsigned i;

    if (s->busy || addr + size > s->flash_size) {
        return MEMTX_ERROR;
    }

    for (i = 0; i < size; i++) {
        hwaddr cur = addr + i;
        uint8_t byte = s->storage[cur];

        value |= (uint64_t)byte << (i * 8);
    }
    *data = value;
    return MEMTX_OK;
}

static MemTxResult rp2040_xip_read(void *opaque, hwaddr addr, uint64_t *data,
                                   unsigned size, MemTxAttrs attrs)
{
    return rp2040_xip_read_data(opaque, addr, data, size);
}

static MemTxResult rp2040_xip_alias_read(void *opaque, hwaddr addr,
                                         uint64_t *data, unsigned size,
                                         MemTxAttrs attrs)
{
    return rp2040_xip_read_data(opaque, addr, data, size);
}

static MemTxResult rp2040_xip_write(void *opaque, hwaddr addr, uint64_t data,
                                    unsigned size, MemTxAttrs attrs)
{
    RP2040XipState *s = opaque;
    unsigned i;

    if (!s->xip_writable) {
        return MEMTX_ERROR;
    }
    if (addr + size > s->flash_size) {
        return MEMTX_ERROR;
    }

    for (i = 0; i < size; i++) {
        s->storage[addr + i] = extract64(data, i * 8, 8);
    }
    return MEMTX_OK;
}

static uint64_t rp2040_xip_ctrl_read(void *opaque, hwaddr addr, unsigned size)
{
    RP2040XipState *s = opaque;
    hwaddr offset = addr & 0xfff;
    uint64_t value;

    switch (offset) {
    case RP2040_XIP_CTRL:
        value = s->xip_ctrl;
        break;
    case RP2040_XIP_FLUSH:
    case RP2040_XIP_CTR_HIT:
    case RP2040_XIP_CTR_ACC:
        value = 0;
        break;
    case RP2040_XIP_STAT:
        value = rp2040_xip_stat(s);
        break;
    case RP2040_XIP_STREAM_ADDR:
        value = s->stream_addr;
        break;
    case RP2040_XIP_STREAM_CTR:
        value = s->stream_ctr;
        break;
    case RP2040_XIP_STREAM_FIFO:
        value = rp2040_xip_stream_pop(s);
        break;
    default:
        value = 0;
        qemu_log_mask(LOG_UNIMP, "rp2040.xip.ctrl: unimplemented read  "
                      "(size %d, addr 0x%08" HWADDR_PRIx
                      ", offset 0x%04" HWADDR_PRIx
                      ") -> 0x%0*" PRIx64 "\n",
                      size, RP2040_XIP_CTRL_BASE + addr, offset,
                      size << 1, value);
        break;
    }

    return value;
}

static void rp2040_xip_ctrl_write(void *opaque, hwaddr addr, uint64_t value,
                                  unsigned size)
{
    RP2040XipState *s = opaque;
    hwaddr alias = addr & ATOMIC_ALIAS_MASK;
    hwaddr offset = addr & 0xfff;
    uint32_t new_value;

    switch (offset) {
    case RP2040_XIP_CTRL:
        new_value = rp2040_xip_apply_alias(s->xip_ctrl, value, alias);
        s->xip_ctrl = new_value & (RP2040_XIP_CTRL_EN |
                                   RP2040_XIP_CTRL_ERR_BADWRITE);
        break;
    case RP2040_XIP_FLUSH:
        rp2040_xip_stream_clear(s);
        break;
    case RP2040_XIP_CTR_HIT:
    case RP2040_XIP_CTR_ACC:
        break;
    case RP2040_XIP_STREAM_ADDR:
        s->stream_addr = value & ~3u;
        break;
    case RP2040_XIP_STREAM_CTR:
        s->stream_ctr = value & RP2040_XIP_STREAM_CTR_MASK;
        if (s->stream_ctr == 0) {
            rp2040_xip_stream_clear(s);
        } else {
            rp2040_xip_stream_fill(s);
        }
        break;
    default:
        qemu_log_mask(LOG_UNIMP, "rp2040.xip.ctrl: unimplemented write "
                      "(size %d, addr 0x%08" HWADDR_PRIx
                      ", offset 0x%04" HWADDR_PRIx
                      ", value 0x%0*" PRIx64 ")\n",
                      size, RP2040_XIP_CTRL_BASE + addr, offset,
                      size << 1, value);
        break;
    }
}

static uint64_t rp2040_xip_aux_read(void *opaque, hwaddr addr, unsigned size)
{
    return rp2040_xip_stream_pop(opaque);
}

