patchew-project/qemu/hw/ssi/rp2040_xip.c
static void rp2040_xip_aux_write(void *opaque, hwaddr addr,
                                 uint64_t value, unsigned size)
{
    rp2040_log_nyi("xip.aux", "write",
                   "XIP auxiliary stream FIFO is read-only");
}

static uint64_t rp2040_xip_ssi_read(void *opaque, hwaddr addr, unsigned size)
{
    RP2040XipState *s = opaque;
    hwaddr offset = addr & 0xfff;
    uint8_t value;
    uint32_t risr = s->rx_len > s->rx_pos ? 0 : 1;
    uint64_t ret;

    if (offset >= RP2040_SSI_DR0 && offset <= RP2040_SSI_DR_END) {
        unsigned i;

        if (s->tx_len > 0 && s->ssi_bulk_remaining == 0) {
            if (s->rx_pos < s->rx_len) {
                value = s->rx[s->rx_pos++];
            } else {
                value = 0;
            }
            if (s->rx_pos == s->rx_len) {
                rp2040_xip_rx_clear(s);
            }
            return value;
        }

        ret = 0;
        for (i = 0; i < size; i++) {
            if (s->rx_pos == s->rx_len) {
                rp2040_xip_rx_clear(s);
                rp2040_xip_ssi_bulk_fill(s);
            }
            if (s->rx_pos < s->rx_len) {
                value = s->rx[s->rx_pos++];
            } else {
                value = 0;
            }
            ret |= (uint64_t)value << (i * 8);
        }
        if (s->rx_pos == s->rx_len) {
            rp2040_xip_rx_clear(s);
            rp2040_xip_ssi_bulk_fill(s);
        }
        return ret;
    }

    switch (offset) {
    case RP2040_SSI_CTRLR0:
        ret = s->ctrlr0;
        break;
    case RP2040_SSI_CTRLR1:
        ret = s->ctrlr1;
        break;
    case RP2040_SSI_SSIENR:
        ret = s->ssienr;
        break;
    case RP2040_SSI_SER:
        ret = s->ser;
        break;
    case RP2040_SSI_BAUDR:
        ret = s->baudr;
        break;
    case RP2040_SSI_TXFTLR:
        ret = s->txftlr;
        break;
    case RP2040_SSI_RXFTLR:
        ret = s->rxftlr;
        break;
    case RP2040_SSI_TXFLR:
        ret = 0;
        break;
    case RP2040_SSI_RXFLR:
        ret = s->rx_len - s->rx_pos;
        break;
    case RP2040_SSI_SR:
        ret = RP2040_SSI_SR_TFE | RP2040_SSI_SR_TFNF |
              (s->busy ? RP2040_SSI_SR_BUSY : 0) |
              (s->rx_len > s->rx_pos ? RP2040_SSI_SR_RFNE : 0) |
              (s->rx_len - s->rx_pos == ARRAY_SIZE(s->rx) ?
               RP2040_SSI_SR_RFF : 0);
        break;
    case RP2040_SSI_IMR:
        ret = s->imr;
        break;
    case RP2040_SSI_ISR:
    case RP2040_SSI_RISR:
        ret = risr;
        break;
    case RP2040_SSI_TXOICR:
    case RP2040_SSI_RXOICR:
    case RP2040_SSI_RXUICR:
    case RP2040_SSI_MSTICR:
    case RP2040_SSI_ICR:
        ret = 0;
        break;
    case RP2040_SSI_DMACR:
        ret = s->dmacr;
        break;
    case RP2040_SSI_DMATDLR:
        ret = s->dmatdlr;
        break;
    case RP2040_SSI_DMARDLR:
        ret = s->dmardlr;
        break;
    case RP2040_SSI_IDR:
        ret = 0;
        break;
    case RP2040_SSI_VERSION_ID:
        ret = 0x3430312a;
        break;
    case RP2040_SSI_RX_SAMPLE_DLY:
        ret = s->rx_sample_dly;
        break;
    case RP2040_SSI_SPI_CTRLR0:
        ret = s->spi_ctrlr0;
        break;
    default:
        ret = 0;
        qemu_log_mask(LOG_UNIMP, "rp2040.xip.ssi: unimplemented read  "
                      "(size %d, addr 0x%08" HWADDR_PRIx
                      ", offset 0x%04" HWADDR_PRIx
                      ") -> 0x%0*" PRIx64 "\n",
                      size, RP2040_XIP_SSI_BASE + addr, offset,
                      size << 1, ret);
        break;
    }

    return ret;
}

static void rp2040_xip_ssi_write(void *opaque, hwaddr addr, uint64_t value,
                                 unsigned size)
{
    RP2040XipState *s = opaque;
    hwaddr alias = addr & ATOMIC_ALIAS_MASK;
    hwaddr offset = addr & 0xfff;
    uint32_t old_ssienr = s->ssienr;
    uint32_t old_ser = s->ser;
    uint32_t new_value;

    if (offset >= RP2040_SSI_DR0 && offset <= RP2040_SSI_DR_END) {
        if (s->tx_len < 8 || (s->tx_len & 0x3f) == 0) {
            trace_rp2040_xip_dr_write(value, size, s->tx_len, s->ctrlr0,
                                      s->ctrlr1, s->spi_ctrlr0);
        }
        if (size == 4 && (value & 0xff) == FLASH_CMD_CONTINUATION_READ) {
            rp2040_xip_ssi_bulk_start(s, value >> 8, s->ctrlr1 + 1);
            return;
        }
        rp2040_xip_dr_write(s, value & 0xff);
        return;
    }

    switch (offset) {
    case RP2040_SSI_CTRLR0:
        s->ctrlr0 = rp2040_xip_apply_alias(s->ctrlr0, value, alias);
        trace_rp2040_xip_ctrlr0(s->ctrlr0);
        break;
    case RP2040_SSI_CTRLR1:
        s->ctrlr1 = rp2040_xip_apply_alias(s->ctrlr1, value, alias);
        trace_rp2040_xip_ctrlr1(s->ctrlr1);
        break;
    case RP2040_SSI_SSIENR:
        new_value = rp2040_xip_apply_alias(s->ssienr, value, alias);
        s->ssienr = new_value & 1;
        trace_rp2040_xip_ssienr(old_ssienr, s->ssienr, s->tx_len);
        if ((old_ssienr & 1) && !s->ssienr) {
            rp2040_xip_finish_command(s);
        }
        if (!s->ssienr) {
            rp2040_xip_rx_clear(s);
            rp2040_xip_reset_tx(s);
        }
        break;
    case RP2040_SSI_SER:
        new_value = rp2040_xip_apply_alias(s->ser, value, alias);
        s->ser = new_value & 1;
        trace_rp2040_xip_ser(old_ser, s->ser, s->tx_len);
        if ((old_ser & 1) && !s->ser) {
            rp2040_xip_finish_command(s);
        }
        break;
    case RP2040_SSI_BAUDR:
        new_value = rp2040_xip_apply_alias(s->baudr, value, alias);
        s->baudr = new_value & 0xffff;
        break;
    case RP2040_SSI_TXFTLR:
        new_value = rp2040_xip_apply_alias(s->txftlr, value, alias);
        s->txftlr = new_value & 0xff;
        break;
    case RP2040_SSI_RXFTLR:
        new_value = rp2040_xip_apply_alias(s->rxftlr, value, alias);
        s->rxftlr = new_value & 0xff;
        break;
    case RP2040_SSI_IMR:
        new_value = rp2040_xip_apply_alias(s->imr, value, alias);
        s->imr = new_value & 0x3f;
        break;
    case RP2040_SSI_DMACR:
        new_value = rp2040_xip_apply_alias(s->dmacr, value, alias);
        s->dmacr = new_value & (RP2040_SSI_DMACR_TDMAE |
                                RP2040_SSI_DMACR_RDMAE);
        break;
    case RP2040_SSI_DMATDLR:
        s->dmatdlr = rp2040_xip_apply_alias(s->dmatdlr, value, alias) & 0xff;
        break;
    case RP2040_SSI_DMARDLR:
        s->dmardlr = rp2040_xip_apply_alias(s->dmardlr, value, alias) & 0xff;
        break;
    case RP2040_SSI_RX_SAMPLE_DLY:
        s->rx_sample_dly = rp2040_xip_apply_alias(s->rx_sample_dly, value,
                                                  alias) & 0xff;
        break;
    case RP2040_SSI_SPI_CTRLR0:
        s->spi_ctrlr0 = rp2040_xip_apply_alias(s->spi_ctrlr0, value, alias);
        trace_rp2040_xip_spi_ctrlr0(s->spi_ctrlr0);
        break;
    default:
        qemu_log_mask(LOG_UNIMP, "rp2040.xip.ssi: unimplemented write "
                      "(size %d, addr 0x%08" HWADDR_PRIx
                      ", offset 0x%04" HWADDR_PRIx
                      ", value 0x%0*" PRIx64 ")\n",
                      size, RP2040_XIP_SSI_BASE + addr, offset,
                      size << 1, value);
        break;
    }
}

static const MemoryRegionOps rp2040_xip_ops = {
    .read_with_attrs = rp2040_xip_read,
    .write_with_attrs = rp2040_xip_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = true,
    },
};

