patchew-project/qemu/hw/ssi/rp2040_xip.c
static const MemoryRegionOps rp2040_xip_alias_ops = {
    .read_with_attrs = rp2040_xip_alias_read,
    .write_with_attrs = rp2040_xip_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = true,
    },
};

static const MemoryRegionOps rp2040_xip_ctrl_ops = {
    .read = rp2040_xip_ctrl_read,
    .write = rp2040_xip_ctrl_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 4,
        .max_access_size = 4,
    },
};

static const MemoryRegionOps rp2040_xip_ssi_ops = {
    .read = rp2040_xip_ssi_read,
    .write = rp2040_xip_ssi_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = true,
    },
};

static const MemoryRegionOps rp2040_xip_aux_ops = {
    .read = rp2040_xip_aux_read,
    .write = rp2040_xip_aux_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 4,
        .max_access_size = 4,
    },
};

void rp2040_xip_set_writable(RP2040XipState *s, bool writable)
{
    s->xip_writable = writable;
}

void rp2040_xip_qspi_cs(RP2040XipState *s, bool high)
{
    if (s->qspi_cs_high == high) {
        return;
    }

    trace_rp2040_xip_qspi_cs(high, s->tx_len);
    s->qspi_cs_high = high;

    if (high) {
        rp2040_xip_finish_command(s);
    } else {
        rp2040_xip_rx_clear(s);
        rp2040_xip_reset_tx(s);
    }
}

static bool rp2040_xip_load_elf(RP2040XipState *s, const char *filename,
                                Error **errp)
{
    g_autofree gchar *contents = NULL;
    gsize len;
    const Elf32_Ehdr *ehdr;
    const Elf32_Phdr *phdr;
    int i;

    if (!g_file_get_contents(filename, &contents, &len, NULL)) {
        error_setg(errp, "could not load flash image '%s'", filename);
        return true;
    }

    if (len < sizeof(*ehdr)) {
        return false;
    }

    ehdr = (const Elf32_Ehdr *)contents;
    if (memcmp(ehdr->e_ident, ELFMAG, SELFMAG) != 0) {
        return false;
    }
    if (ehdr->e_ident[EI_CLASS] != ELFCLASS32 ||
        ehdr->e_ident[EI_DATA] != ELFDATA2LSB ||
        le16_to_cpu(ehdr->e_machine) != EM_ARM) {
        error_setg(errp, "unsupported flash ELF image '%s'", filename);
        return true;
    }
    if (le32_to_cpu(ehdr->e_phoff) > len ||
        le16_to_cpu(ehdr->e_phentsize) != sizeof(*phdr) ||
        le16_to_cpu(ehdr->e_phnum) >
        (len - le32_to_cpu(ehdr->e_phoff)) / sizeof(*phdr)) {
        error_setg(errp, "invalid flash ELF image '%s'", filename);
        return true;
    }

    phdr = (const Elf32_Phdr *)(contents + le32_to_cpu(ehdr->e_phoff));
    for (i = 0; i < le16_to_cpu(ehdr->e_phnum); i++) {
        uint32_t paddr = le32_to_cpu(phdr[i].p_paddr);
        uint32_t filesz = le32_to_cpu(phdr[i].p_filesz);
        uint32_t memsz = le32_to_cpu(phdr[i].p_memsz);
        uint32_t off = le32_to_cpu(phdr[i].p_offset);
        uint32_t xip_off;

        if (le32_to_cpu(phdr[i].p_type) != PT_LOAD) {
            continue;
        }

        if (filesz == 0) {
            continue;
        }

        if (paddr < RP2040_XIP_FLASH_BASE ||
            paddr - RP2040_XIP_FLASH_BASE > s->flash_size ||
            filesz > memsz ||
            filesz > s->flash_size - (paddr - RP2040_XIP_FLASH_BASE) ||
            off > len ||
            filesz > len - off) {
            error_setg(errp, "flash ELF segment is outside XIP storage");
            return true;
        }

        xip_off = paddr - RP2040_XIP_FLASH_BASE;
        memcpy(s->storage + xip_off, contents + off, filesz);
    }

    return true;
}

static bool rp2040_xip_load_uf2(RP2040XipState *s, const char *filename,
                                Error **errp)
{
    g_autofree gchar *contents = NULL;
    gsize len;
    unsigned blocks;
    unsigned i;
    bool copied = false;

    if (!g_file_get_contents(filename, &contents, &len, NULL)) {
        error_setg(errp, "could not load flash image '%s'", filename);
        return true;
    }

    if (len < UF2_BLOCK_SIZE ||
        ldl_le_p(contents) != UF2_MAGIC_START0 ||
        ldl_le_p(contents + 4) != UF2_MAGIC_START1) {
        return false;
    }

    if (len % UF2_BLOCK_SIZE != 0) {
        error_setg(errp, "invalid UF2 image '%s': size is not a multiple "
                   "of %u bytes", filename, UF2_BLOCK_SIZE);
        return true;
    }

    blocks = len / UF2_BLOCK_SIZE;
    for (i = 0; i < blocks; i++) {
        const uint8_t *block = (uint8_t *)contents + i * UF2_BLOCK_SIZE;
        uint32_t flags;
        uint32_t target;
        uint32_t payload_size;
        uint32_t family_id;
        uint32_t offset;

        if (ldl_le_p(block) != UF2_MAGIC_START0 ||
            ldl_le_p(block + 4) != UF2_MAGIC_START1 ||
            ldl_le_p(block + UF2_BLOCK_SIZE - 4) != UF2_MAGIC_END) {
            error_setg(errp, "invalid UF2 image '%s': bad magic in block %u",
                       filename, i);
            return true;
        }

        flags = ldl_le_p(block + 8);
        if (flags & UF2_FLAG_NOT_MAIN_FLASH) {
            continue;
        }

        if (!(flags & UF2_FLAG_FAMILY_ID_PRESENT)) {
            error_setg(errp, "invalid RP2040 UF2 image '%s': block %u has "
                       "no family ID", filename, i);
            return true;
        }

        family_id = ldl_le_p(block + 28);
        if (family_id != UF2_RP2040_FAMILY_ID) {
            error_setg(errp, "unsupported UF2 family ID 0x%08" PRIx32
                       " in '%s'", family_id, filename);
            return true;
        }

        target = ldl_le_p(block + 12);
        payload_size = ldl_le_p(block + 16);
        if (payload_size > UF2_MAX_PAYLOAD ||
            target < RP2040_XIP_FLASH_BASE ||
            target - RP2040_XIP_FLASH_BASE > s->flash_size ||
            payload_size > s->flash_size -
                           (target - RP2040_XIP_FLASH_BASE)) {
            error_setg(errp, "UF2 block %u in '%s' is outside XIP flash",
                       i, filename);
            return true;
        }

        offset = target - RP2040_XIP_FLASH_BASE;
        memcpy(s->storage + offset, block + UF2_HEADER_SIZE, payload_size);
        copied = true;
    }

    if (!copied) {
        error_setg(errp, "UF2 image '%s' contains no RP2040 flash payload",
                   filename);
    }

