patchew-project/qemu/hw/ssi/rp2040_xip.c
    return true;
}

void rp2040_xip_load_image(RP2040XipState *s, const char *filename,
                           Error **errp)
{
    Error *local_err = NULL;
    ssize_t image_size;

    if (!filename) {
        return;
    }

    if (rp2040_xip_load_elf(s, filename, &local_err)) {
        if (local_err) {
            error_propagate(errp, local_err);
            return;
        }
        if (!rp2040_xip_fixup_boot2(s, filename, errp)) {
            return;
        }
        rp2040_xip_writeback(s, errp);
        return;
    }

    if (rp2040_xip_load_uf2(s, filename, &local_err)) {
        if (local_err) {
            error_propagate(errp, local_err);
            return;
        }
        if (!rp2040_xip_fixup_boot2(s, filename, errp)) {
            return;
        }
        rp2040_xip_writeback(s, errp);
        return;
    }

    image_size = load_image_size(filename, s->storage, s->flash_size);
    if (image_size < 0) {
        error_setg(errp, "could not load flash image '%s'", filename);
        return;
    }
    if (!rp2040_xip_fixup_boot2(s, filename, errp)) {
        return;
    }
    rp2040_xip_writeback(s, errp);
}

bool rp2040_xip_flash_range_erase(RP2040XipState *s, uint32_t flash_offs,
                                  uint32_t count, uint32_t block_size,
                                  uint8_t block_cmd, Error **errp)
{
    if (!QEMU_IS_ALIGNED(flash_offs, FLASH_SECTOR_SIZE) ||
        !QEMU_IS_ALIGNED(count, FLASH_SECTOR_SIZE)) {
        error_setg(errp, "flash erase range is not sector-aligned");
        return false;
    }
    if (flash_offs > s->flash_size || count > s->flash_size - flash_offs) {
        error_setg(errp, "flash erase range is outside XIP storage");
        return false;
    }
    if (block_size && block_size != 64 * KiB) {
        g_autofree char *detail = g_strdup_printf("block size %" PRIu32,
                                                  block_size);

        rp2040_log_nyi("bootrom", "flash_range_erase block size", detail);
    }
    if (block_cmd != 0x20 && block_cmd != 0xd8) {
        g_autofree char *detail = g_strdup_printf("erase command 0x%02x",
                                                  block_cmd);

        rp2040_log_nyi("bootrom", "flash_range_erase command", detail);
    }

    memset(s->storage + flash_offs, 0xff, count);
    return rp2040_xip_writeback(s, errp);
}

bool rp2040_xip_flash_range_program(RP2040XipState *s, uint32_t flash_offs,
                                    uint32_t data_addr, uint32_t count,
                                    Error **errp)
{
    g_autofree uint8_t *buf = NULL;
    uint32_t i;

    if (!QEMU_IS_ALIGNED(flash_offs, FLASH_PAGE_SIZE) ||
        !QEMU_IS_ALIGNED(count, FLASH_PAGE_SIZE)) {
        error_setg(errp, "flash program range is not page-aligned");
        return false;
    }
    if (flash_offs > s->flash_size || count > s->flash_size - flash_offs) {
        error_setg(errp, "flash program range is outside XIP storage");
        return false;
    }

    buf = g_malloc(count);
    if (address_space_read(&address_space_memory, data_addr,
                           MEMTXATTRS_UNSPECIFIED, buf, count) != MEMTX_OK) {
        error_setg(errp, "could not read flash program buffer at 0x%08" PRIx32,
                   data_addr);
        return false;
    }

    for (i = 0; i < count; i++) {
        s->storage[flash_offs + i] &= buf[i];
    }

    return rp2040_xip_writeback(s, errp);
}

static void rp2040_xip_realize(DeviceState *dev, Error **errp)
{
    RP2040XipState *s = RP2040_XIP(dev);
    g_autofree gchar *contents = NULL;
    gsize contents_len = 0;

    if (s->flash_size == 0) {
        error_setg(errp, "flash-size must be non-zero");
        return;
    }

    s->xip_writable = true;
    s->storage = g_malloc0(s->flash_size);
    memset(s->storage, 0xff, s->flash_size);

    if (s->flash_file) {
        if (!g_file_get_contents(s->flash_file, &contents, &contents_len,
                                 NULL)) {
            error_setg(errp, "could not load flash file '%s'",
                       s->flash_file);
            return;
        }
        if (contents_len > s->flash_size) {
            error_setg(errp, "flash file '%s' is %" G_GSIZE_FORMAT
                       " bytes, larger than %" G_GSIZE_FORMAT
                       " byte Pico flash",
                       s->flash_file, contents_len, (gsize)s->flash_size);
            return;
        }
        memcpy(s->storage, contents, contents_len);
    }

    memory_region_init_io(&s->xip, OBJECT(dev), &rp2040_xip_ops, s,
                          "rp2040.xip", s->flash_size);
    memory_region_init_io(&s->xip_noalloc, OBJECT(dev),
                          &rp2040_xip_alias_ops, s, "rp2040.xip.noalloc",
                          s->flash_size);
    memory_region_init_io(&s->xip_nocache, OBJECT(dev),
                          &rp2040_xip_alias_ops, s, "rp2040.xip.nocache",
                          s->flash_size);
    memory_region_init_io(&s->xip_nocache_noalloc, OBJECT(dev),
                          &rp2040_xip_alias_ops, s,
                          "rp2040.xip.nocache-noalloc", s->flash_size);
    memory_region_init_io(&s->ctrl, OBJECT(dev), &rp2040_xip_ctrl_ops, s,
                          "rp2040.xip.ctrl", RP2040_XIP_CTRL_SIZE);
    memory_region_init_io(&s->ssi, OBJECT(dev), &rp2040_xip_ssi_ops, s,
                          "rp2040.xip.ssi", RP2040_XIP_SSI_SIZE);
    memory_region_init_io(&s->aux, OBJECT(dev), &rp2040_xip_aux_ops, s,
                          "rp2040.xip.aux", RP2040_XIP_AUX_SIZE);

    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->xip);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->ctrl);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->ssi);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->aux);
}

static void rp2040_xip_reset(DeviceState *dev)
{
    RP2040XipState *s = RP2040_XIP(dev);

    s->xip_ctrl = RP2040_XIP_CTRL_EN | RP2040_XIP_CTRL_ERR_BADWRITE;
    s->ctrlr0 = 0;
    s->ctrlr1 = 0;
    s->ssienr = 0;
    s->ser = 0;
    s->baudr = 0;
    s->txftlr = 0;
    s->rxftlr = 0;
    s->imr = 0;
    s->dmacr = 0;
    s->dmatdlr = 0;
    s->dmardlr = 4;
    s->rx_sample_dly = 0;
    s->spi_ctrlr0 = 0;
    s->write_enable = false;
    s->busy = false;
    s->qspi_cs_high = true;
    s->stream_addr = 0;
    s->stream_ctr = 0;
    rp2040_xip_stream_clear(s);
    rp2040_xip_reset_tx(s);
    rp2040_xip_rx_clear(s);
}

static void rp2040_xip_finalize(Object *obj)
{
    RP2040XipState *s = RP2040_XIP(obj);

    g_free(s->flash_file);
    g_free(s->storage);
}

static void rp2040_xip_init(Object *obj)
{
    RP2040XipState *s = RP2040_XIP(obj);

    qdev_init_gpio_out_named(DEVICE(obj), &s->dreq_rx, "dreq-rx", 1);
    qdev_init_gpio_out_named(DEVICE(obj), &s->dreq_stream, "dreq-stream", 1);
}

static const Property rp2040_xip_properties[] = {
    DEFINE_PROP_UINT32("flash-size", RP2040XipState, flash_size, 2 * MiB),
    DEFINE_PROP_STRING("flash-file", RP2040XipState, flash_file),
    DEFINE_PROP_UINT64("flash-uid", RP2040XipState, flash_uid,
                       FLASH_UID_DEFAULT),
};

static void rp2040_xip_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = rp2040_xip_realize;
    device_class_set_legacy_reset(dc, rp2040_xip_reset);
    device_class_set_props(dc, rp2040_xip_properties);
}

static const TypeInfo rp2040_xip_info = {
    .name          = TYPE_RP2040_XIP,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(RP2040XipState),
    .instance_init = rp2040_xip_init,
    .instance_finalize = rp2040_xip_finalize,
    .class_init    = rp2040_xip_class_init,
};

static void rp2040_xip_register_types(void)
{
    type_register_static(&rp2040_xip_info);
}
type_init(rp2040_xip_register_types)
